{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.20.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_2",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                16
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "embedding_2_input"
            }
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_2",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [
                null,
                16
              ],
              "input_dim": 3638,
              "output_dim": 100,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": null
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_2",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_2",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 100,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "gain": 1.0,
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                },
                "registered_name": null
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 3638,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": true,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of2.bin",
        "group1-shard2of2.bin"
      ],
      "weights": [
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell/kernel",
          "shape": [
            100,
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell/recurrent_kernel",
          "shape": [
            100,
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell/bias",
          "shape": [
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell/kernel",
          "shape": [
            100,
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell/recurrent_kernel",
          "shape": [
            100,
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell/bias",
          "shape": [
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            200,
            3638
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            3638
          ],
          "dtype": "float32"
        },
        {
          "name": "embedding_2/embeddings",
          "shape": [
            3638,
            100
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}